export interface Department {
  id: string;
  name: string;
}

export interface Division {
  id: string;
  name: string;
  departments: Department[];
}

export const DIVISIONS: Division[] = [
  {
    id: "ฝ่ายการพยาบาล",
    name: "ฝ่ายการพยาบาล",
    departments: [
      { id: "งานการพยาบาลผู้คลอด", name: "งานการพยาบาลผู้คลอด" },
      {
        id: "งานการพยาบาลผู้ป่วยสูติ-นรีเวชกรรมสามัญ",
        name: "งานการพยาบาลผู้ป่วยสูติ-นรีเวชกรรมสามัญ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยสูติ-นรีเวชกรรมพิเศษ",
        name: "งานการพยาบาลผู้ป่วยสูติ-นรีเวชกรรมพิเศษ",
      },
      {
        id: "งานการพยาบาลเวชศาสตร์การเจริญพันธุ์",
        name: "งานการพยาบาลเวชศาสตร์การเจริญพันธุ์",
      },
      {
        id: "งานการพยาบาลเวชศาสตร์มารดาและทารกในครรภ์",
        name: "งานการพยาบาลเวชศาสตร์มารดาและทารกในครรภ์",
      },
      {
        id: "งานการพยาบาลผู้ป่วยนรีเวชกรรมพิเศษ (2570)",
        name: "งานการพยาบาลผู้ป่วยนรีเวชกรรมพิเศษ (2570)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยนรีเวชกรรมสามัญ (2570)",
        name: "งานการพยาบาลผู้ป่วยนรีเวชกรรมสามัญ (2570)",
      },
      { id: "หน่วยการพยาบาลอิตถีบูรณา", name: "หน่วยการพยาบาลอิตถีบูรณา" },
      {
        id: "หน่วยการพยาบาลผู้ป่วยมะเร็งนรีเวช",
        name: "หน่วยการพยาบาลผู้ป่วยมะเร็งนรีเวช",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรม 1",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรม 1",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรม 2",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรม 2",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรม 3",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรม 3",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรมพิเศษ 1",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรมพิเศษ 1",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรมพิเศษ 2",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรมพิเศษ 2",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรมอุบัติเหตุ",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรมอุบัติเหตุ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรมหัวใจและทรวงอก (2571)",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรมหัวใจและทรวงอก (2571)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยอายุรกรรมชายสามัญ",
        name: "งานการพยาบาลผู้ป่วยอายุรกรรมชายสามัญ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยอายุรกรรมหญิงสามัญ",
        name: "งานการพยาบาลผู้ป่วยอายุรกรรมหญิงสามัญ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยอายุรกรรมชายพิเศษ",
        name: "งานการพยาบาลผู้ป่วยอายุรกรรมชายพิเศษ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยอายุรกรรมหญิงพิเศษ",
        name: "งานการพยาบาลผู้ป่วยอายุรกรรมหญิงพิเศษ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 4",
        name: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 4",
      },
      {
        id: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 5",
        name: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 5",
      },
      {
        id: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 6 (2571)",
        name: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 6 (2571)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยอายุรกรรมสามัญดุลโสภาคย์ 6 (2571)",
        name: "งานการพยาบาลผู้ป่วยอายุรกรรมสามัญดุลโสภาคย์ 6 (2571)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยอายุรกรรมสามัญดุลโสภาคย์ 9 (2571)",
        name: "งานการพยาบาลผู้ป่วยอายุรกรรมสามัญดุลโสภาคย์ 9 (2571)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยอายุรกรรมพิเศษดุลโสภาคย์ 9 (2571)",
        name: "งานการพยาบาลผู้ป่วยอายุรกรรมพิเศษดุลโสภาคย์ 9 (2571)",
      },
      { id: "งานการพยาบาลผู้ป่วยปัญจา", name: "งานการพยาบาลผู้ป่วยปัญจา" },
      {
        id: "งานการพยาบาลผู้ป่วยโรคหลอดเลือดสมอง และระบบประสาท",
        name: "งานการพยาบาลผู้ป่วยโรคหลอดเลือดสมอง และระบบประสาท",
      },
      {
        id: "งานการพยาบาลผู้ป่วยอายุรกรรมความดันลบ",
        name: "งานการพยาบาลผู้ป่วยอายุรกรรมความดันลบ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยเคมีบำบัดและศูนย์ปลูกถ่ายเซลล์ต้นกำเนิดเม็ดเลือด",
        name: "งานการพยาบาลผู้ป่วยเคมีบำบัดและศูนย์ปลูกถ่ายเซลล์ต้นกำเนิดเม็ดเลือด",
      },
      {
        id: "งานการพยาบาลผู้ป่วยอายุรกรรมกิตติวัฒนา",
        name: "งานการพยาบาลผู้ป่วยอายุรกรรมกิตติวัฒนา",
      },
      {
        id: "งานการพยาบาลผู้ป่วยนอกเคมีบำบัดและหอผู้ป่วยพิเศษเคมีบำบัด",
        name: "งานการพยาบาลผู้ป่วยนอกเคมีบำบัดและหอผู้ป่วยพิเศษเคมีบำบัด",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตทารกแรกเกิด",
        name: "งานการพยาบาลผู้ป่วยวิกฤตทารกแรกเกิด",
      },
      {
        id: "งานการพยาบาลผู้ป่วยกึ่งวิกฤตทารกแรกเกิด",
        name: "งานการพยาบาลผู้ป่วยกึ่งวิกฤตทารกแรกเกิด",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตกุมารเวชกรรม",
        name: "งานการพยาบาลผู้ป่วยวิกฤตกุมารเวชกรรม",
      },
      {
        id: "งานการพยาบาลผู้ป่วยกุมารเวชกรรมพิเศษ",
        name: "งานการพยาบาลผู้ป่วยกุมารเวชกรรมพิเศษ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 1/1",
        name: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 1/1",
      },
      {
        id: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 1/2 (2570)",
        name: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 1/2 (2570)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 2",
        name: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 2",
      },
      {
        id: "งานการพยาบาลผู้ป่วยกุมารเวชกรรมพิเศษรวม (2570)",
        name: "งานการพยาบาลผู้ป่วยกุมารเวชกรรมพิเศษรวม (2570)",
      },
      {
        id: "งานการพยาบาลตรวจโรคเวชศาสตร์ทั่วไปและครอบครัว",
        name: "งานการพยาบาลตรวจโรคเวชศาสตร์ทั่วไปและครอบครัว",
      },
      {
        id: "งานการพยาบาลตรวจโรคอายุรกรรม 1",
        name: "งานการพยาบาลตรวจโรคอายุรกรรม 1",
      },
      {
        id: "งานการพยาบาลตรวจโรคอายุรกรรม 2",
        name: "งานการพยาบาลตรวจโรคอายุรกรรม 2",
      },
      {
        id: "งานการพยาบาลตรวจโรคอายุรกรรม 3 (2568)",
        name: "งานการพยาบาลตรวจโรคอายุรกรรม 3 (2568)",
      },
      {
        id: "งานการพยาบาลตรวจโรคกุมารเวชกรรม 1",
        name: "งานการพยาบาลตรวจโรคกุมารเวชกรรม 1",
      },
      {
        id: "งานการพยาบาลตรวจโรคกุมารเวชกรรม 2 (2569)",
        name: "งานการพยาบาลตรวจโรคกุมารเวชกรรม 2 (2569)",
      },
      { id: "งานการพยาบาลสุขภาพจิต", name: "งานการพยาบาลสุขภาพจิต" },
      { id: "หน่วยการพยาบาลรวมใจรักษ์", name: "หน่วยการพยาบาลรวมใจรักษ์" },
      {
        id: "หน่วยการพยาบาลตรวจโรคภูมิแพ้ โรคหืด และโรคระบบหายใจ",
        name: "หน่วยการพยาบาลตรวจโรคภูมิแพ้ โรคหืด และโรคระบบหายใจ",
      },
      {
        id: "หน่วยการพยาบาลพัฒนาการเด็กและวัยรุ่น (2569)",
        name: "หน่วยการพยาบาลพัฒนาการเด็กและวัยรุ่น (2569)",
      },
      {
        id: "หน่วยประสานบริการผู้ป่วยมะเร็ง",
        name: "หน่วยประสานบริการผู้ป่วยมะเร็ง",
      },
      {
        id: "งานการพยาบาลตรวจโรคสูติ-นรีเวชกรรม",
        name: "งานการพยาบาลตรวจโรคสูติ-นรีเวชกรรม",
      },
      {
        id: "งานการพยาบาลตรวจโรค หู คอ จมูก",
        name: "งานการพยาบาลตรวจโรค หู คอ จมูก",
      },
      {
        id: "งานการพยาบาลตรวจโรคศัลยกรรม 1",
        name: "งานการพยาบาลตรวจโรคศัลยกรรม 1",
      },
      {
        id: "งานการพยาบาลตรวจโรคศัลยกรรม 2",
        name: "งานการพยาบาลตรวจโรคศัลยกรรม 2",
      },
      {
        id: "งานการพยาบาลตรวจโรคศัลยกรรมกระดูกและข้อ",
        name: "งานการพยาบาลตรวจโรคศัลยกรรมกระดูกและข้อ",
      },
      { id: "งานการพยาบาลตรวจโรคจักษุ 1", name: "งานการพยาบาลตรวจโรคจักษุ 1" },
      {
        id: "งานการพยาบาลตรวจโรคจักษุ 2 (2569)",
        name: "งานการพยาบาลตรวจโรคจักษุ 2 (2569)",
      },
      { id: "งานการพยาบาลตรวจโรคผิวหนัง", name: "งานการพยาบาลตรวจโรคผิวหนัง" },
      {
        id: "หน่วยการพยาบาลตรวจโรคเวชศาสตร์ฟื้นฟู",
        name: "หน่วยการพยาบาลตรวจโรคเวชศาสตร์ฟื้นฟู",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยเบาหวาน",
        name: "หน่วยการพยาบาลผู้ป่วยเบาหวาน",
      },
      {
        id: "งานการพยาบาลคัดกรองและรับผู้ป่วยใน",
        name: "งานการพยาบาลคัดกรองและรับผู้ป่วยใน",
      },
      { id: "งานอุบัติเหตุและฉุกเฉิน", name: "งานอุบัติเหตุและฉุกเฉิน" },
      { id: "งานการพยาบาลรังสีวิทยา", name: "งานการพยาบาลรังสีวิทยา" },
      {
        id: "งานการพยาบาลผู้ป่วยต่อเนื่อง",
        name: "งานการพยาบาลผู้ป่วยต่อเนื่อง",
      },
      {
        id: "งานบริการการแพทย์ฉุกเฉินและปฏิบัติการส่งต่อผู้ป่วยระหว่างสถานพยาบาล",
        name: "งานบริการการแพทย์ฉุกเฉินและปฏิบัติการส่งต่อผู้ป่วยระหว่างสถานพยาบาล",
      },
      {
        id: "งานการพยาบาลหัตถการและตรวจโรคนอกเวลาราชการ",
        name: "งานการพยาบาลหัตถการและตรวจโรคนอกเวลาราชการ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยจักษุสามัญ 1",
        name: "งานการพยาบาลผู้ป่วยจักษุสามัญ 1",
      },
      {
        id: "งานการพยาบาลผู้ป่วยจักษุสามัญ 2 (2570)",
        name: "งานการพยาบาลผู้ป่วยจักษุสามัญ 2 (2570)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยจักษุพิเศษ (2570)",
        name: "งานการพยาบาลผู้ป่วยจักษุพิเศษ (2570)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยหู คอ จมูก ทันตกรรม ศัลยศาสตร์ช่องปากและแม็กซิลโลเฟเชียล 1",
        name: "งานการพยาบาลผู้ป่วยหู คอ จมูก ทันตกรรม ศัลยศาสตร์ช่องปากและแม็กซิลโลเฟเชียล 1",
      },
      {
        id: "งานการพยาบาลผู้ป่วยหู คอ จมูก ทันตกรรม ศัลยศาสตร์ช่องปากและแม็กซิลโลเฟเชียล 2 (2570)",
        name: "งานการพยาบาลผู้ป่วยหู คอ จมูก ทันตกรรม ศัลยศาสตร์ช่องปากและแม็กซิลโลเฟเชียล 2 (2570)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรมกระดูกและข้อพิเศษ",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรมกระดูกและข้อพิเศษ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรมกระดูกและข้อสามัญ/เวชศาสตร์ฟื้นฟู",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรมกระดูกและข้อสามัญ/เวชศาสตร์ฟื้นฟู",
      },
      {
        id: "งานการพยาบาลผู้ป่วยศัลยกรรมระบบประสาท",
        name: "งานการพยาบาลผู้ป่วยศัลยกรรมระบบประสาท",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรม",
        name: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรม",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมหัวใจและทรวงอก",
        name: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมหัวใจและทรวงอก",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตโรคหัวใจ",
        name: "งานการพยาบาลผู้ป่วยวิกฤตโรคหัวใจ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมระบบประสาท",
        name: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมระบบประสาท",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตอายุรกรรม",
        name: "งานการพยาบาลผู้ป่วยวิกฤตอายุรกรรม",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตวิสัญญี",
        name: "งานการพยาบาลผู้ป่วยวิกฤตวิสัญญี",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตระบบการหายใจ",
        name: "งานการพยาบาลผู้ป่วยวิกฤตระบบการหายใจ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตไฟไหม้น้ำร้อนลวก",
        name: "งานการพยาบาลผู้ป่วยวิกฤตไฟไหม้น้ำร้อนลวก",
      },
      {
        id: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมอุบัติเหตุ",
        name: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมอุบัติเหตุ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยกึ่งวิกฤตโรคหัวใจ (2570)",
        name: "งานการพยาบาลผู้ป่วยกึ่งวิกฤตโรคหัวใจ (2570)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยกึ่งวิกฤตรวม (2570)",
        name: "งานการพยาบาลผู้ป่วยกึ่งวิกฤตรวม (2570)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยผ่าตัด หน่วยผ่าตัด 1",
        name: "งานการพยาบาลผู้ป่วยผ่าตัด หน่วยผ่าตัด 1",
      },
      {
        id: "งานการพยาบาลผู้ป่วยผ่าตัด หน่วยผ่าตัด 2",
        name: "งานการพยาบาลผู้ป่วยผ่าตัด หน่วยผ่าตัด 2",
      },
      {
        id: "งานการพยาบาลผู้ป่วยผ่าตัด หน่วยผ่าตัด 3",
        name: "งานการพยาบาลผู้ป่วยผ่าตัด หน่วยผ่าตัด 3",
      },
      { id: "งานการพยาบาลผู้ป่วยวิสัญญี", name: "งานการพยาบาลผู้ป่วยวิสัญญี" },
      {
        id: "งานการพยาบาลผู้ป่วยก่อนและหลังผ่าตัด",
        name: "งานการพยาบาลผู้ป่วยก่อนและหลังผ่าตัด",
      },
      {
        id: "งานการพยาบาลผู้ป่วยส่องกล้องและหัตถการพิเศษ",
        name: "งานการพยาบาลผู้ป่วยส่องกล้องและหัตถการพิเศษ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยผ่าตัดไม่ค้างคืน",
        name: "งานการพยาบาลผู้ป่วยผ่าตัดไม่ค้างคืน",
      },
      {
        id: "งานการพยาบาลผู้ป่วยผ่าตัดเปลี่ยนข้อ (2568)",
        name: "งานการพยาบาลผู้ป่วยผ่าตัดเปลี่ยนข้อ (2568)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 1",
        name: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 1",
      },
      {
        id: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 2",
        name: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 2",
      },
      {
        id: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 3",
        name: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 3",
      },
      {
        id: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 4",
        name: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 4",
      },
      {
        id: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 5",
        name: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 5",
      },
      {
        id: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 6",
        name: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 6",
      },
      { id: "งานการพยาบาลผู้สูงอายุ", name: "งานการพยาบาลผู้สูงอายุ" },
      {
        id: "งานการพยาบาลผู้ป่วยประคับประคอง",
        name: "งานการพยาบาลผู้ป่วยประคับประคอง",
      },
      {
        id: "หน่วยเวชศาสตร์ผู้สูงอายุ (2569)",
        name: "หน่วยเวชศาสตร์ผู้สูงอายุ (2569)",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยฟื้นฟูระยะกลาง (2569)",
        name: "หน่วยการพยาบาลผู้ป่วยฟื้นฟูระยะกลาง (2569)",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยระยะยาว ชั้น 4 (2569)",
        name: "หน่วยการพยาบาลผู้ป่วยระยะยาว ชั้น 4 (2569)",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยระยะยาว ชั้น 5 (2569)",
        name: "หน่วยการพยาบาลผู้ป่วยระยะยาว ชั้น 5 (2569)",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยพิเศษ ชั้น 6 (2569)",
        name: "หน่วยการพยาบาลผู้ป่วยพิเศษ ชั้น 6 (2569)",
      },
      { id: "งานควบคุมโรคติดเชื้อ", name: "งานควบคุมโรคติดเชื้อ" },
      {
        id: "งานการพยาบาลตรวจโรคติดเชื้อแพร่กระจายทางอากาศ",
        name: "งานการพยาบาลตรวจโรคติดเชื้อแพร่กระจายทางอากาศ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยโรคหัวใจและหลอดเลือด",
        name: "งานการพยาบาลผู้ป่วยโรคหัวใจและหลอดเลือด",
      },
      {
        id: "งานการพยาบาลผู้ป่วยตรวจสวนหัวใจและหลอดเลือด (2569)",
        name: "งานการพยาบาลผู้ป่วยตรวจสวนหัวใจและหลอดเลือด (2569)",
      },
      {
        id: "งานการพยาบาลผู้ป่วยโรคไตและไตเทียม",
        name: "งานการพยาบาลผู้ป่วยโรคไตและไตเทียม",
      },
      {
        id: "งานการพยาบาลดูแลสุขภาพเชิงป้องกัน",
        name: "งานการพยาบาลดูแลสุขภาพเชิงป้องกัน",
      },
      {
        id: "หน่วยการพยาบาลไตเทียมประสิทธิภาพสูง",
        name: "หน่วยการพยาบาลไตเทียมประสิทธิภาพสูง",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยปลูกถ่ายอวัยวะ (2568)",
        name: "หน่วยการพยาบาลผู้ป่วยปลูกถ่ายอวัยวะ (2568)",
      },
    ],
  },
  {
    id: "ฝ่ายเภสัชกรรม",
    name: "ฝ่ายเภสัชกรรม",
    departments: [
      { id: "งานเภสัชกรรมผู้ป่วยนอก", name: "งานเภสัชกรรมผู้ป่วยนอก" },
      { id: "งานเภสัชกรรมผู้ป่วยใน", name: "งานเภสัชกรรมผู้ป่วยใน" },
      { id: "งานจัดซื้อยา", name: "งานจัดซื้อยา" },
      { id: "งานคลังยา", name: "งานคลังยา" },
      { id: "งานผลิตยา", name: "งานผลิตยา" },
      { id: "งานบริบาลเภสัชกรรม", name: "งานบริบาลเภสัชกรรม" },
      { id: "งานเคมีบำบัด", name: "งานเคมีบำบัด" },
      {
        id: "งานเภสัชกรรมศูนย์ธรรมศาสตร์ธรรมรักษ์และเภสัชกรรมปฐมภูมิ",
        name: "งานเภสัชกรรมศูนย์ธรรมศาสตร์ธรรมรักษ์และเภสัชกรรมปฐมภูมิ",
      },
    ],
  },
  {
    id: "ฝ่ายบริหารแผนและการคลัง",
    name: "ฝ่ายบริหารแผนและการคลัง",
    departments: [
      { id: "งานการเงิน", name: "งานการเงิน" },
      { id: "งานบัญชี", name: "งานบัญชี" },
      { id: "งานรายได้", name: "งานรายได้" },
      { id: "งานจัดหาพัสดุ", name: "งานจัดหาพัสดุ" },
      { id: "งานทะเบียนและคลังพัสดุ", name: "งานทะเบียนและคลังพัสดุ" },
      { id: "งานนโยบายและแผน", name: "งานนโยบายและแผน" },
      { id: "งานจัดส่งกลาง", name: "งานจัดส่งกลาง" },
      {
        id: "งานองค์กรสัมพันธ์และการตลาด",
        name: "งานองค์กรสัมพันธ์และการตลาด",
      },
    ],
  },
  {
    id: "ฝ่ายสหเวชศาสตร์",
    name: "ฝ่ายสหเวชศาสตร์",
    departments: [
      {
        id: "หมวดงานปฏิบัติการตรวจวินิจฉัยทางการแพทย์",
        name: "หมวดงานปฏิบัติการตรวจวินิจฉัยทางการแพทย์",
      },
      {
        id: "หมวดงานจุลทรรศนศาสตร์และปรสิตวิทยา",
        name: "หมวดงานจุลทรรศนศาสตร์และปรสิตวิทยา",
      },
      {
        id: "หมวดงานบริหารจัดการสิ่งส่งตรวจและบริการศูนย์การแพทย์ธรรมศาสตร์",
        name: "หมวดงานบริหารจัดการสิ่งส่งตรวจและบริการศูนย์การแพทย์ธรรมศาสตร์",
      },
      { id: "หมวดงานภูมิคุ้มกันวิทยา", name: "หมวดงานภูมิคุ้มกันวิทยา" },
      {
        id: "หมวดงานรับสิ่งส่งตรวจและห้องปฏิบัติการส่งต่อ",
        name: "หมวดงานรับสิ่งส่งตรวจและห้องปฏิบัติการส่งต่อ",
      },
      {
        id: "หมวดงานบริหารจัดการสิ่งส่งตรวจและบริการผู้ป่วยนอก รพธ.",
        name: "หมวดงานบริหารจัดการสิ่งส่งตรวจและบริการผู้ป่วยนอก รพธ.",
      },
      { id: "หมวดงานเคมีคลินิก", name: "หมวดงานเคมีคลินิก" },
      { id: "หมวดงานโลหิตวิทยา", name: "หมวดงานโลหิตวิทยา" },
      {
        id: "หมวดงานบริหารจัดการเครื่องมือ ณ จุดดูแลผู้ป่วย",
        name: "หมวดงานบริหารจัดการเครื่องมือ ณ จุดดูแลผู้ป่วย",
      },
      { id: "งานเวชศาสตร์บริการโลหิต", name: "งานเวชศาสตร์บริการโลหิต" },
      { id: "งานกายภาพบำบัด", name: "งานกายภาพบำบัด" },
      { id: "งานเครื่องมือแพทย์", name: "งานเครื่องมือแพทย์" },
      { id: "งานส่งเสริมสุขภาพ", name: "งานส่งเสริมสุขภาพ" },
      { id: "งานจุลชีววิทยา", name: "งานจุลชีววิทยา" },
      { id: "งานรังสีวิทยา", name: "งานรังสีวิทยา" },
      {
        id: "หน่วยรังสีรักษาและมะเร็งวิทยา",
        name: "หน่วยรังสีรักษาและมะเร็งวิทยา",
      },
      {
        id: "หน่วยกายภาพบำบัดและการฟื้นฟูศูนย์ธรรมรักษ์",
        name: "หน่วยกายภาพบำบัดและการฟื้นฟูศูนย์ธรรมรักษ์",
      },
    ],
  },
  {
    id: "ฝ่ายสนับสนุนบริการ",
    name: "ฝ่ายสนับสนุนบริการ",
    departments: [
      { id: "งานเวชสารสนเทศ", name: "งานเวชสารสนเทศ" },
      { id: "งานประกันสุขภาพ", name: "งานประกันสุขภาพ" },
      { id: "งานสังคมสงเคราะห์", name: "งานสังคมสงเคราะห์" },
      { id: "งานโภชนาการ", name: "งานโภชนาการ" },
      { id: "งานเวชภัณฑ์ปลอดเชื้อ", name: "งานเวชภัณฑ์ปลอดเชื้อ" },
      { id: "งานบริการผ้า", name: "งานบริการผ้า" },
      {
        id: "งานบริการเคลื่อนย้ายผู้ป่วย",
        name: "งานบริการเคลื่อนย้ายผู้ป่วย",
      },
      { id: "งานบริการยานพาหนะ", name: "งานบริการยานพาหนะ" },
      {
        id: "งานเวชระเบียนและสิทธิการรักษา",
        name: "งานเวชระเบียนและสิทธิการรักษา",
      },
    ],
  },
  {
    id: "ฝ่ายบริหาร",
    name: "ฝ่ายบริหาร",
    departments: [
      { id: "งานสารบรรณและธุรการ", name: "งานสารบรรณและธุรการ" },
      { id: "งานสารสนเทศ", name: "งานสารสนเทศ" },
      { id: "งานพัฒนาคุณภาพการบริการ", name: "งานพัฒนาคุณภาพการบริการ" },
      { id: "งานบริหารทรัพยากรมนุษย์", name: "งานบริหารทรัพยากรมนุษย์" },
      {
        id: "งานสื่อสารองค์กรและกิจการพิเศษ",
        name: "งานสื่อสารองค์กรและกิจการพิเศษ",
      },
      { id: "งานพัฒนาทรัพยากรมนุษย์", name: "งานพัฒนาทรัพยากรมนุษย์" },
      { id: "งานพัฒนาเทคโนโลยีดิจิทัล", name: "งานพัฒนาเทคโนโลยีดิจิทัล" },
      {
        id: "งานอาชีวอนามัยและความปลอดภัย",
        name: "งานอาชีวอนามัยและความปลอดภัย",
      },
      { id: "หน่วยวินัยและนิติการ", name: "หน่วยวินัยและนิติการ" },
    ],
  },
  {
    id: "ฝ่ายการแพทย์",
    name: "ฝ่ายการแพทย์",
    departments: [
      { id: "สาขารังสี", name: "สาขารังสี" },
      { id: "สาขาสูติ-นรีเวชกรรม", name: "สาขาสูติ-นรีเวชกรรม" },
      { id: "สาขาศัลยกรรม", name: "สาขาศัลยกรรม" },
      { id: "สาขาศัลยกรรมกระดูกและข้อ", name: "สาขาศัลยกรรมกระดูกและข้อ" },
      { id: "สาขาอายุรกรรม", name: "สาขาอายุรกรรม" },
      { id: "สาขากุมารเวชกรรม", name: "สาขากุมารเวชกรรม" },
      { id: "สาขาจักษุ", name: "สาขาจักษุ" },
      { id: "สาขาหู คอ จมูก", name: "สาขาหู คอ จมูก" },
      { id: "สาขาวิสัญญี", name: "สาขาวิสัญญี" },
      { id: "สาขานิติเวช", name: "สาขานิติเวช" },
      { id: "สาขาพยาธิ", name: "สาขาพยาธิ" },
      { id: "สาขาเวชกรรมฟื้นฟู", name: "สาขาเวชกรรมฟื้นฟู" },
      { id: "สาขาเวชกรรมฉุกเฉิน", name: "สาขาเวชกรรมฉุกเฉิน" },
      { id: "สาขาจิตเวช", name: "สาขาจิตเวช" },
      {
        id: "สาขาเวชปฏิบัติทั่วไปและเวชกรรมครอบครัว",
        name: "สาขาเวชปฏิบัติทั่วไปและเวชกรรมครอบครัว",
      },
    ],
  },
  {
    id: "ฝ่ายทันตกรรม",
    name: "ฝ่ายทันตกรรม",
    departments: [
      { id: "งานบริการทางทันตกรรม", name: "งานบริการทางทันตกรรม" },
      { id: "งานบริหารทางทันตกรรม", name: "งานบริหารทางทันตกรรม" },
      {
        id: "งานวิจัยและนวัตกรรมทางทันตกรรม",
        name: "งานวิจัยและนวัตกรรมทางทันตกรรม",
      },
      { id: "งานทันตกรรมศูนย์ธรรมรักษ์", name: "งานทันตกรรมศูนย์ธรรมรักษ์" },
    ],
  },
  {
    id: "ฝ่ายพัฒนากายภาพ",
    name: "ฝ่ายพัฒนากายภาพ",
    departments: [
      { id: "งานวิศวกรรมโครงสร้าง", name: "งานวิศวกรรมโครงสร้าง" },
      { id: "งานวิศวกรรมบริการ", name: "งานวิศวกรรมบริการ" },
      {
        id: "งานพัฒนาระบบวิศวกรรมโรงพยาบาล",
        name: "งานพัฒนาระบบวิศวกรรมโรงพยาบาล",
      },
      { id: "งานอาคารสถานที่", name: "งานอาคารสถานที่" },
    ],
  },
  {
    id: "ศูนย์การแพทย์ธรรมศาสตร์",
    name: "ศูนย์การแพทย์ธรรมศาสตร์",
    departments: [],
  },
  {
    id: "ศูนย์นวัตกรรมสุขภาพธรรมศาสตร์",
    name: "ศูนย์นวัตกรรมสุขภาพธรรมศาสตร์",
    departments: [
      { id: "งานตรวจวินิจฉัยทางการแพทย์", name: "งานตรวจวินิจฉัยทางการแพทย์" },
      {
        id: "ศูนย์ความเป็นเลิศทางการแพทย์ (COE)",
        name: "ศูนย์ความเป็นเลิศทางการแพทย์ (COE)",
      },
      {
        id: "ศูนย์พัฒนาสู่ความเป็นเลิศทางการแพทย์",
        name: "ศูนย์พัฒนาสู่ความเป็นเลิศทางการแพทย์",
      },
      { id: "หน่วยวิจัยและนวัตกรรม", name: "หน่วยวิจัยและนวัตกรรม" },
      {
        id: "หน่วยพันธุศาสตร์ทางการแพทย์",
        name: "หน่วยพันธุศาสตร์ทางการแพทย์",
      },
    ],
  },
  {
    id: "ศูนย์ธรรมศาสตร์ธรรมรักษ์",
    name: "ศูนย์ธรรมศาสตร์ธรรมรักษ์",
    departments: [
      { id: "งานบริหารทั่วไป", name: "งานบริหารทั่วไป" },
      {
        id: "หน่วยกายภาพบำบัดและการฟื้นฟูศูนย์ธรรมรักษ์_ธรรมรักษ์",
        name: "หน่วยกายภาพบำบัดและการฟื้นฟูศูนย์ธรรมรักษ์",
      },
      {
        id: "งานเภสัชกรรมศูนย์ธรรมศาสตร์ธรรมรักษ์และเภสัชกรรมปฐมภูมิ_ธรรมรักษ์",
        name: "งานเภสัชกรรมศูนย์ธรรมศาสตร์ธรรมรักษ์และเภสัชกรรมปฐมภูมิ",
      },
      {
        id: "งานทันตกรรมศูนย์ธรรมรักษ์_ธรรมรักษ์",
        name: "งานทันตกรรมศูนย์ธรรมรักษ์",
      },
      {
        id: "งานการพยาบาลผู้สูงอายุ_ธรรมรักษ์",
        name: "งานการพยาบาลผู้สูงอายุ",
      },
      {
        id: "งานการพยาบาลผู้ป่วยประคับประคอง_ธรรมรักษ์",
        name: "งานการพยาบาลผู้ป่วยประคับประคอง",
      },
      {
        id: "หน่วยเวชศาสตร์ผู้สูงอายุ_ธรรมรักษ์",
        name: "หน่วยเวชศาสตร์ผู้สูงอายุ",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยฟื้นฟูระยะกลาง_ธรรมรักษ์",
        name: "หน่วยการพยาบาลผู้ป่วยฟื้นฟูระยะกลาง",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยระยะยาว ชั้น 4_ธรรมรักษ์",
        name: "หน่วยการพยาบาลผู้ป่วยระยะยาว ชั้น 4",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยระยะยาว ชั้น 5_ธรรมรักษ์",
        name: "หน่วยการพยาบาลผู้ป่วยระยะยาว ชั้น 5",
      },
      {
        id: "หน่วยการพยาบาลผู้ป่วยพิเศษ ชั้น 6_ธรรมรักษ์",
        name: "หน่วยการพยาบาลผู้ป่วยพิเศษ ชั้น 6",
      },
    ],
  },
];
